import client from '../../Assets/client-icon.png';

export const comments = [
    {
        id: 1,
        image: client,
        title: 'Дмитрий Петров',
        subtitle: 'триатлонист',
        text: 'Приятная атмосфера и профессиональные тренировки в Триатлон Центре. Очень рекомендую! Приятная атмосфера и профессиональные тренировки в Триатлон Центре. Очень рекомендую!',
    },
    {
        id: 2,
        image: client,
        title: 'Дмитрий Петров',
        subtitle: 'триатлонист',
        text: 'Приятная атмосфера и профессиональные тренировки в Триатлон Центре. Очень рекомендую! Приятная атмосфера и профессиональные тренировки в Триатлон Центре. Очень рекомендую! Приятная атмосфера и профессиональные тренировки в Триатлон Центре. Очень рекомендую!',
    },
    {
        id: 3,
        image: client,
        title: 'Дмитрий Петров',
        subtitle: 'триатлонист',
        text: 'Приятная атмосфера и профессиональные тренировки в Триатлон Центре. Очень рекомендую!',
    },
    {
        id: 4,
        image: client,
        title: 'Дмитрий Петров',
        subtitle: 'триатлонист',
        text: 'Приятная атмосфера и профессиональные тренировки в Триатлон Центре. Очень рекомендую!',
    },
    {
        id: 5,
        image: client,
        title: 'Дмитрий Петров',
        subtitle: 'триатлонист',
        text: 'Приятная атмосфера и профессиональные тренировки в Триатлон Центре. Очень рекомендую!',
    },
    {
        id: 6,
        image: client,
        title: 'Дмитрий Петров',
        subtitle: 'триатлонист',
        text: 'Приятная атмосфера и профессиональные тренировки в Триатлон Центре. Очень рекомендую!',
    },
];

export const fetchAll = () => {
    return { comments };
}
