import './style.scss'

const Section = () => {
    return(
        <div id="section">
            <div className="section">
                <h1>Секции Триатлон</h1>
                <div className="section--blocks">
                    <div className="section--blocks__block1">
                        <div className="section--blocks__block1--zgolok">
                            <h2>Группа</h2>
                        </div>
                        <h4>Раннее развитие, 5-7 лет</h4>
                        <h4>Школьники 7-10 лет</h4>
                        <h4>Школьники подготовка 
                         триатлон 13 лет</h4>
                        <h4>Подростки 13-15 лет</h4>
                        <h4>Подростки 16-18 (19)</h4>
                        <h4>Секция триатлона для
                         любителей УТРО(7:00 - 10:00</h4>
                        <h4>Секция триатлона для
                        любителей ВЕЧЕР(18:30 - 21:30</h4>
                        <h4>Секция выходного
                           дня Плавания</h4>
                        <h4>Секция выходного
                        дня Аквалон</h4>
                    </div>
                    <div className="section--blocks__block1">
                        <div className="section--blocks__block1--zgolok">
                            <h2>Примечание</h2>
                        </div>
                        <h4>Плавание, ОФП как дополнение
                         до/после тренировки</h4>
                        <h4>Плавание, ОФП, основа бега</h4>
                        <h4>Плавание, ОФП, основа бега,
                         начало владением велосипеда
                        (станок)</h4>
                        <h4>Полная подготовка</h4>
                        <h4>Полная подготовка</h4>
                        <h4>Полная подготовка</h4>
                        <h4>Полная подготовка</h4>
                        <h4>Дети от 5 до 16 лет</h4>
                        <h4>Дети от 5 до 16 лет</h4>
                    </div>
                    <div className="section--blocks__block1">
                        <div className="section--blocks__block1--zgolok">
                            <h2>Кол-во часов в нед.</h2>
                        </div>
                        <h4>2-4 часа, 3 тренировки</h4>
                        <h4>4-5 часов, 4-5 тренировок</h4>
                        <h4>3 тренировки, 5-6 часов</h4>
                        <h4>4-5 тр., 6-7 часов</h4>
                        <h4>10-11 тр., 12-14 часов</h4>
                        <h4>10-11 тр., 12-14 часов</h4>
                        <h4>10-11 тр., 12-14 часов</h4>
                        <h4>СБ, ВС</h4>
                        <h4>СБ, ВС</h4>
                    </div>
                    <div className="section--blocks__block1">
                        <div className="section--blocks__block1--zgolok">
                            <h2>Стоимость</h2>
                        </div>
                        <h4>3000 с/3 мес., 4500 с/ мес.</h4>
                        <h4>16 000 с/ 3 мес., 5800 с/мес</h4>
                        <h4>20 000 с/ 3 мес., 7000 с/мес</h4>
                        <h4>23 000 с/ 3 мес., 8000 с/мес</h4>
                        <h4>33 000 с/ 3 мес., 11 500 с/мес</h4>
                        <h4>33 000 с/ 3 мес., 11 500 с/мес</h4>
                        <h4>37 000 с/ 3 мес., 12 800 с/мес</h4>
                        <h4>13 500 с/3 мес</h4>
                        <h4>18 500 с/3 мес</h4>
                    </div>
                </div>
            </div>
        </div>
    )
}

export default Section