import React,  { useState }  from 'react'
import './FAQ.scss'



const FAQ = ({ question, answer }) => {
    const [isOpen, setIsOpen] = useState(false);
  
    const handleToggle = () => {
        setIsOpen(!isOpen);
    };

    return (
        <div className="faq">
            <div className="faq_container">

                <h3 className="faq_title">Часто задаваемые вопросы:</h3>
                <div className="chief_block">
                    <div className="all_questions">
                
                        <div className="boks_questions" >
                            <h4 className="title_questions">Каковы варианты членства?</h4>
                            <span onClick={handleToggle} className="arrow">{isOpen ? (<svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" fill="currentColor" className="bi bi-chevron-down" viewBox="0 0 16 16">
                                <path fillRule="evenodd" d="M1.646 4.646a.5.5 0 0 1 .708 0L8 10.293l5.646-5.647a.5.5 0 0 1 .708.708l-6 6a.5.5 0 0 1-.708 0l-6-6a.5.5 0 0 1 0-.708"/>
                            </svg>) : ( <svg  xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                                <path fillRule="evenodd" clipRule="evenodd" d="M10.5299 6.46983C10.3893 6.32938 10.1987 6.25049 9.99991 6.25049C9.80116 6.25049 9.61054 6.32938 9.46991 6.46983L5.21991 10.7198C5.14622 10.7885 5.08712 10.8713 5.04613 10.9633C5.00514 11.0553 4.98309 11.1546 4.98132 11.2553C4.97954 11.356 4.99807 11.456 5.03579 11.5494C5.07351 11.6428 5.12965 11.7276 5.20087 11.7989C5.27209 11.8701 5.35692 11.9262 5.45031 11.964C5.5437 12.0017 5.64373 12.0202 5.74443 12.0184C5.84513 12.0166 5.94445 11.9946 6.03645 11.9536C6.12845 11.9126 6.21125 11.8535 6.27991 11.7798L9.99991 8.05983L13.7199 11.7798C13.8621 11.9123 14.0501 11.9844 14.2444 11.981C14.4387 11.9776 14.6241 11.8989 14.7615 11.7614C14.8989 11.624 14.9777 11.4387 14.9811 11.2444C14.9845 11.05 14.9124 10.862 14.7799 10.7198L10.5299 6.46983Z" fill="white"/>
                            </svg>)}</span>
                            <div className="answer_faq">
                                { isOpen && <div className="answer">{'Мы предлагаем различные варианты членства в соответствии с вашими потребностями. От ежемесячных до годовых планов, вы можете выбрать тот, который лучше всего подходит именно вам. Наш дружелюбный персонал будет рад помочь вам в выборе правильного членства.'}</div>}
                            </div>

                            <div className="boks_questions">
                                <h4 className="title_questions">Какими удобствами вы располагаете?</h4>
                                <span className="arrow"><svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                                    <path fillRule="evenodd" clipRule="evenodd" d="M10.5299 6.46983C10.3893 6.32938 10.1987 6.25049 9.99991 6.25049C9.80116 6.25049 9.61054 6.32938 9.46991 6.46983L5.21991 10.7198C5.14622 10.7885 5.08712 10.8713 5.04613 10.9633C5.00514 11.0553 4.98309 11.1546 4.98132 11.2553C4.97954 11.356 4.99807 11.456 5.03579 11.5494C5.07351 11.6428 5.12965 11.7276 5.20087 11.7989C5.27209 11.8701 5.35692 11.9262 5.45031 11.964C5.5437 12.0017 5.64373 12.0202 5.74443 12.0184C5.84513 12.0166 5.94445 11.9946 6.03645 11.9536C6.12845 11.9126 6.21125 11.8535 6.27991 11.7798L9.99991 8.05983L13.7199 11.7798C13.8621 11.9123 14.0501 11.9844 14.2444 11.981C14.4387 11.9776 14.6241 11.8989 14.7615 11.7614C14.8989 11.624 14.9777 11.4387 14.9811 11.2444C14.9845 11.05 14.9124 10.862 14.7799 10.7198L10.5299 6.46983Z" fill="white"/>
                                </svg></span>
                                {/* <p className="answer">Мы предлагаем различные варианты членства в соответствии с вашими потребностями. От ежемесячных до годовых планов, вы можете выбрать тот, который лучше всего подходит именно вам. Наш дружелюбный персонал будет рад помочь вам в выборе правильного членства.</p> */}
                            </div>
                            <div className="boks_questions">
                                <h4 className="title_questions">Доступны ли персональные тренеры?</h4>
                                <span className="arrow"><svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                                    <path fillRule="evenodd" clipRule="evenodd" d="M10.5299 6.46983C10.3893 6.32938 10.1987 6.25049 9.99991 6.25049C9.80116 6.25049 9.61054 6.32938 9.46991 6.46983L5.21991 10.7198C5.14622 10.7885 5.08712 10.8713 5.04613 10.9633C5.00514 11.0553 4.98309 11.1546 4.98132 11.2553C4.97954 11.356 4.99807 11.456 5.03579 11.5494C5.07351 11.6428 5.12965 11.7276 5.20087 11.7989C5.27209 11.8701 5.35692 11.9262 5.45031 11.964C5.5437 12.0017 5.64373 12.0202 5.74443 12.0184C5.84513 12.0166 5.94445 11.9946 6.03645 11.9536C6.12845 11.9126 6.21125 11.8535 6.27991 11.7798L9.99991 8.05983L13.7199 11.7798C13.8621 11.9123 14.0501 11.9844 14.2444 11.981C14.4387 11.9776 14.6241 11.8989 14.7615 11.7614C14.8989 11.624 14.9777 11.4387 14.9811 11.2444C14.9845 11.05 14.9124 10.862 14.7799 10.7198L10.5299 6.46983Z" fill="white"/>
                                </svg></span>
                                {/* <p className="answer">Мы предлагаем различные варианты членства в соответствии с вашими потребностями. От ежемесячных до годовых планов, вы можете выбрать тот, который лучше всего подходит именно вам. Наш дружелюбный персонал будет рад помочь вам в выборе правильного членства.</p> */}
                            </div>
                            <div className="boks_questions">
                                <h4 className="title_questions">Какие занятия вы предлагаете?</h4>
                                <span className="arrow"><svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                                    <path fillRule="evenodd" clipRule="evenodd" d="M10.5299 6.46983C10.3893 6.32938 10.1987 6.25049 9.99991 6.25049C9.80116 6.25049 9.61054 6.32938 9.46991 6.46983L5.21991 10.7198C5.14622 10.7885 5.08712 10.8713 5.04613 10.9633C5.00514 11.0553 4.98309 11.1546 4.98132 11.2553C4.97954 11.356 4.99807 11.456 5.03579 11.5494C5.07351 11.6428 5.12965 11.7276 5.20087 11.7989C5.27209 11.8701 5.35692 11.9262 5.45031 11.964C5.5437 12.0017 5.64373 12.0202 5.74443 12.0184C5.84513 12.0166 5.94445 11.9946 6.03645 11.9536C6.12845 11.9126 6.21125 11.8535 6.27991 11.7798L9.99991 8.05983L13.7199 11.7798C13.8621 11.9123 14.0501 11.9844 14.2444 11.981C14.4387 11.9776 14.6241 11.8989 14.7615 11.7614C14.8989 11.624 14.9777 11.4387 14.9811 11.2444C14.9845 11.05 14.9124 10.862 14.7799 10.7198L10.5299 6.46983Z" fill="white"/>
                                </svg></span>
                                {/* <p className="answer">Мы предлагаем различные варианты членства в соответствии с вашими потребностями. От ежемесячных до годовых планов, вы можете выбрать тот, который лучше всего подходит именно вам. Наш дружелюбный персонал будет рад помочь вам в выборе правильного членства.</p> */}
                            </div>
                            <div className="boks_questions">
                                <h4 className="title_questions">Какие занятия вы предлагаете?</h4>
                                <span className="arrow"><svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                                    <path fillRule="evenodd" clipRule="evenodd" d="M10.5299 6.46983C10.3893 6.32938 10.1987 6.25049 9.99991 6.25049C9.80116 6.25049 9.61054 6.32938 9.46991 6.46983L5.21991 10.7198C5.14622 10.7885 5.08712 10.8713 5.04613 10.9633C5.00514 11.0553 4.98309 11.1546 4.98132 11.2553C4.97954 11.356 4.99807 11.456 5.03579 11.5494C5.07351 11.6428 5.12965 11.7276 5.20087 11.7989C5.27209 11.8701 5.35692 11.9262 5.45031 11.964C5.5437 12.0017 5.64373 12.0202 5.74443 12.0184C5.84513 12.0166 5.94445 11.9946 6.03645 11.9536C6.12845 11.9126 6.21125 11.8535 6.27991 11.7798L9.99991 8.05983L13.7199 11.7798C13.8621 11.9123 14.0501 11.9844 14.2444 11.981C14.4387 11.9776 14.6241 11.8989 14.7615 11.7614C14.8989 11.624 14.9777 11.4387 14.9811 11.2444C14.9845 11.05 14.9124 10.862 14.7799 10.7198L10.5299 6.46983Z" fill="white"/>
                                </svg></span>
                                {/* <p className="answer">Мы предлагаем различные варианты членства в соответствии с вашими потребностями. От ежемесячных до годовых планов, вы можете выбрать тот, который лучше всего подходит именно вам. Наш дружелюбный персонал будет рад помочь вам в выборе правильного членства.</p> */}
                            </div>
                            <div className="boks_questions">
                                <h4 className="title_questions">Какие занятия вы предлагаете?</h4>
                                <span className="arrow"><svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                                    <path fillRule="evenodd" clipRule="evenodd" d="M10.5299 6.46983C10.3893 6.32938 10.1987 6.25049 9.99991 6.25049C9.80116 6.25049 9.61054 6.32938 9.46991 6.46983L5.21991 10.7198C5.14622 10.7885 5.08712 10.8713 5.04613 10.9633C5.00514 11.0553 4.98309 11.1546 4.98132 11.2553C4.97954 11.356 4.99807 11.456 5.03579 11.5494C5.07351 11.6428 5.12965 11.7276 5.20087 11.7989C5.27209 11.8701 5.35692 11.9262 5.45031 11.964C5.5437 12.0017 5.64373 12.0202 5.74443 12.0184C5.84513 12.0166 5.94445 11.9946 6.03645 11.9536C6.12845 11.9126 6.21125 11.8535 6.27991 11.7798L9.99991 8.05983L13.7199 11.7798C13.8621 11.9123 14.0501 11.9844 14.2444 11.981C14.4387 11.9776 14.6241 11.8989 14.7615 11.7614C14.8989 11.624 14.9777 11.4387 14.9811 11.2444C14.9845 11.05 14.9124 10.862 14.7799 10.7198L10.5299 6.46983Z" fill="white"/>
                                </svg></span>
                                {/* <p className="answer">Мы предлагаем различные варианты членства в соответствии с вашими потребностями. От ежемесячных до годовых планов, вы можете выбрать тот, который лучше всего подходит именно вам. Наш дружелюбный персонал будет рад помочь вам в выборе правильного членства.</p> */}
                            </div>  
                            <div className="boks_questions">
                                <h4 className="title_questions">Какие занятия вы предлагаете?</h4>
                                <span className="arrow"><svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                                    <path fillRule="evenodd" clipRule="evenodd" d="M10.5299 6.46983C10.3893 6.32938 10.1987 6.25049 9.99991 6.25049C9.80116 6.25049 9.61054 6.32938 9.46991 6.46983L5.21991 10.7198C5.14622 10.7885 5.08712 10.8713 5.04613 10.9633C5.00514 11.0553 4.98309 11.1546 4.98132 11.2553C4.97954 11.356 4.99807 11.456 5.03579 11.5494C5.07351 11.6428 5.12965 11.7276 5.20087 11.7989C5.27209 11.8701 5.35692 11.9262 5.45031 11.964C5.5437 12.0017 5.64373 12.0202 5.74443 12.0184C5.84513 12.0166 5.94445 11.9946 6.03645 11.9536C6.12845 11.9126 6.21125 11.8535 6.27991 11.7798L9.99991 8.05983L13.7199 11.7798C13.8621 11.9123 14.0501 11.9844 14.2444 11.981C14.4387 11.9776 14.6241 11.8989 14.7615 11.7614C14.8989 11.624 14.9777 11.4387 14.9811 11.2444C14.9845 11.05 14.9124 10.862 14.7799 10.7198L10.5299 6.46983Z" fill="white"/>
                                </svg></span>
                                {/* <p className="answer">Мы предлагаем различные варианты членства в соответствии с вашими потребностями. От ежемесячных до годовых планов, вы можете выбрать тот, который лучше всего подходит именно вам. Наш дружелюбный персонал будет рад помочь вам в выборе правильного членства.</p> */}
                            </div>
                        </div>

                    </div>
                    <div className="additional_questions">
                        <div className="boks_additional">
                            <h1 className="title_additional">Остались вопросы?</h1>
                            <p className="min_text">Мы рады ответить на любой Ваш вопрос, выслушать Ваше предложение.</p>
                            <div className="all_inputs">
                                <div className="border_inp">
                                    <input className="inputp" type="" placeholder="Ваше имя*"/>
                                </div>
                                <div className="border_inp">
                                    <input className="inputp" type="" placeholder="+996(___) ___-___"/>
                                </div>
                                <div className="border3_inp">
                                    <input className="inputp3" type="" placeholder="Напишите Ваш вопрос"/>
                                </div>
                            </div>
                            <button className="btn_additional">Отправить</button>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    );
};



export default FAQ